; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	spectrograph5 - mode
	image1 - mode
	infrared0 - mode
	thermograph2 - mode
	image3 - mode
	spectrograph4 - mode
	GroundStation5 - direction
	Star0 - direction
	Star2 - direction
	Star4 - direction
	Star3 - direction
	Star1 - direction
	Phenomenon6 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 Star0)
	(supports instrument1 infrared0)
	(supports instrument1 spectrograph4)
	(calibration_target instrument1 Star1)
	(supports instrument2 spectrograph5)
	(supports instrument2 image1)
	(calibration_target instrument2 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star10)
	(supports instrument3 image1)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 Star0)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star4)
	(calibration_target instrument4 Star1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
	(supports instrument5 thermograph2)
	(supports instrument5 image3)
	(calibration_target instrument5 Star3)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon8)
	(supports instrument6 spectrograph4)
	(supports instrument6 image1)
	(supports instrument6 spectrograph5)
	(calibration_target instrument6 Star1)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star4)
)
(:goal (and
	(pointing satellite1 GroundStation5)
	(pointing satellite3 Planet7)
	(have_image Phenomenon6 spectrograph4)
	(have_image Phenomenon6 image1)
	(have_image Planet7 thermograph2)
	(have_image Phenomenon8 image1)
	(have_image Phenomenon9 image3)
	(have_image Star10 image1)
))

)

; plan
1. (turn_to satellite3 star1 star4)
   deleted: (pointing satellite3 star4)
   added: (pointing satellite3 star1)
   goals met: 0 of 8
2. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 0 of 8
3. (calibrate satellite3 instrument6 star1)
   added: (calibrated instrument6)
   goals met: 0 of 8
4. (turn_to satellite3 phenomenon6 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 phenomenon6)
   goals met: 0 of 8
5. (turn_to satellite2 star3 phenomenon8)
   deleted: (pointing satellite2 phenomenon8)
   added: (pointing satellite2 star3)
   goals met: 0 of 8
6. (turn_to satellite1 groundstation5 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 groundstation5)
   goals met: 1 of 8
7. (take_image satellite3 phenomenon6 instrument6 spectrograph4)
   added: (have_image phenomenon6 spectrograph4)
   goals met: 2 of 8
8. (take_image satellite3 phenomenon6 instrument6 image1)
   added: (have_image phenomenon6 image1)
   goals met: 3 of 8
9. (switch_on instrument5 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument5)
   goals met: 3 of 8
10. (calibrate satellite2 instrument5 star3)
   added: (calibrated instrument5)
   goals met: 3 of 8
11. (turn_to satellite2 phenomenon9 star3)
   deleted: (pointing satellite2 star3)
   added: (pointing satellite2 phenomenon9)
   goals met: 3 of 8
12. (take_image satellite2 phenomenon9 instrument5 image3)
   added: (have_image phenomenon9 image3)
   goals met: 4 of 8
13. (turn_to satellite2 planet7 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 planet7)
   goals met: 4 of 8
14. (take_image satellite2 planet7 instrument5 thermograph2)
   added: (have_image planet7 thermograph2)
   goals met: 5 of 8
15. (turn_to satellite3 phenomenon8 phenomenon6)
   deleted: (pointing satellite3 phenomenon6)
   added: (pointing satellite3 phenomenon8)
   goals met: 5 of 8
16. (take_image satellite3 phenomenon8 instrument6 image1)
   added: (have_image phenomenon8 image1)
   goals met: 6 of 8
17. (turn_to satellite3 star10 phenomenon8)
   deleted: (pointing satellite3 phenomenon8)
   added: (pointing satellite3 star10)
   goals met: 6 of 8
18. (take_image satellite3 star10 instrument6 image1)
   added: (have_image star10 image1)
   goals met: 7 of 8
19. (turn_to satellite3 planet7 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 planet7)
   goals met: 8 of 8
